Revit 2022 API
SpecTypeId.Reference Members
 This class contains constants identifying specs.
The SpecTypeId.Reference type exposes the following members.
Properties
Name | Description
Image
 Image, in discipline Common.
LoadClassification
 Load Classification, in discipline Electrical.
Material
 Material, in discipline Common.
See Also
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace